Конфигурация/InformationRegisters/УсловияПравилПаевогоИнвестиционногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияПравилПаевогоИнвестиционногоФонда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальнаяСуммаЗачисления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредназначенДляКвалИнвесторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеДепозитарияВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаПрочиеВозмещаемыеРасходыУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыПриЧастичномПогашении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрокаОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяютсяНадбавкиИСкидкиПриЗачисленииИПогашенииПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаНадбавкиПриПриобретенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаСкидкиПриПогашенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровАренды</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДоговораАренды</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыНачисленоУплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоСамостоятельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоПоАктуПроверки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСНДС/Ext/Module.bsl
Функция ВестиУчетНДС(Период, Организация, СчетДоверительногоУправления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.ВестиУчетНДС КАК ВестиУчетНДС
		|ИЗ
		|	РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(
		|			&Период,
		|			ПаевойИнвестиционныйФонд В
		|				(ВЫБРАТЬ
		|					КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|				ИЗ
		|					РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних)) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ВестиУчетНДС;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

Функция ПолучитьДлинуНомераСчетаФактуры()
	
	//по необходимости можно вынести в настройки. Пока тут
	Возврат 7;
	
КонецФункции

Функция ПолучитьНомерСчетаФактуры(ДокументОбъект) Экспорт
	
	ПостфиксСчетовФактур = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "ПостфиксСчетовФактур", ДокументОбъект.СчетДоверительногоУправления);
	ДлинаНомера = ПолучитьДлинуНомераСчетаФактуры();
	Номер = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(МАКСИМУМ(ВЫРАЗИТЬ(ДокументыСчетовФактур.НомерСчетаФактуры КАК СТРОКА(100))), 0) КАК НомерСчетаФактуры
		|ИЗ
		|	(ВЫБРАТЬ
		|		АктПриемаПередачиОбъектовНедвижимости.НомерСчетаФактуры КАК НомерСчетаФактуры
		|	ИЗ
		|		Документ.АктПриемаПередачиОбъектовНедвижимости КАК АктПриемаПередачиОбъектовНедвижимости
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|			ПО АктПриемаПередачиОбъектовНедвижимости.Основание = СделкаСНедвижимостью.Ссылка
		|				И (СделкаСНедвижимостью.ВидПраваНаНедвижимость = ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Собственность))
		|				И (СделкаСНедвижимостью.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа))
		|	ГДЕ
		|		АктПриемаПередачиОбъектовНедвижимости.Организация = &Организация
		|		И АктПриемаПередачиОбъектовНедвижимости.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И АктПриемаПередачиОбъектовНедвижимости.ДатаСчетаФактуры МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ГОД) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|		И АктПриемаПередачиОбъектовНедвижимости.Ссылка <> &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СчетФактура.НомерСчетаФактуры
		|	ИЗ
		|		Документ.СчетФактура КАК СчетФактура
		|	ГДЕ
		|		СчетФактура.ТипСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Выданный)
		|		И СчетФактура.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И СчетФактура.Организация = &Организация
		|		И СчетФактура.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ГОД) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|		И СчетФактура.Ссылка <> &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НачислениеЗадолженности.НомерСчетаФактуры
		|	ИЗ
		|		Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ПО НачислениеЗадолженности.Договор = Договоры.Ссылка
		|				И (Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Аренды))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровАренды.СрезПоследних(
		|					&Дата,
		|					Организация = &Организация
		|						И ВидДоговораАренды = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровАренды.Передачи)) КАК УсловияДоговоровАрендыСрезПоследних
		|			ПО (Договоры.Ссылка = УсловияДоговоровАрендыСрезПоследних.Договор)
		|	ГДЕ
		|		НачислениеЗадолженности.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И НачислениеЗадолженности.Организация = &Организация
		|		И НачислениеЗадолженности.ДатаСчетаФактуры МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ГОД) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|		И НачислениеЗадолженности.Ссылка <> &Ссылка) КАК ДокументыСчетовФактур";
	
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДокументОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ПостфиксСчетовФактур", ПостфиксСчетовФактур);
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДанных.Следующий() Тогда
		Если ПостфиксСчетовФактур <> "" Тогда
			ПредыдущийНомер = Лев(ВыборкаДанных.НомерСчетаФактуры, ДлинаНомера);
		Иначе
			ПредыдущийНомер = ВыборкаДанных.НомерСчетаФактуры;
		КонецЕсли;
		
		Попытка 
			Номер = Число("0"+ПредыдущийНомер) + 1;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить номер счета-фактуры для предыдущего номера " 
				+ ВыборкаДанных.НомерСчетаФактуры + " (после преобразования: " + ПредыдущийНомер + ")",,,,);
			Возврат "/" + ПостфиксСчетовФактур;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Формат(Номер,"ЧЦ=" + ДлинаНомера + "; ЧВН=; ЧГ=") + "/" + ПостфиксСчетовФактур;
	
КонецФункции

Функция НомерСчетаФактурыУникален(Ссылка, НомерСчетаФактуры, Дата, СчетДоверительногоУправления, Организация) Экспорт
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктПриемаПередачиОбъектовНедвижимости.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.АктПриемаПередачиОбъектовНедвижимости КАК АктПриемаПередачиОбъектовНедвижимости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|		ПО АктПриемаПередачиОбъектовНедвижимости.Основание = СделкаСНедвижимостью.Ссылка
		|			И (СделкаСНедвижимостью.ВидПраваНаНедвижимость = ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Собственность))
		|			И (СделкаСНедвижимостью.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа))
		|ГДЕ
		|	АктПриемаПередачиОбъектовНедвижимости.Организация = &Организация
		|	И АктПриемаПередачиОбъектовНедвижимости.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И АктПриемаПередачиОбъектовНедвижимости.ДатаСчетаФактуры МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ГОД) И КОНЕЦПЕРИОДА(&Дата, ГОД)
		|	И АктПриемаПередачиОбъектовНедвижимости.Ссылка <> &Ссылка
		|	И АктПриемаПередачиОбъектовНедвижимости.НомерСчетаФактуры = &НомерСчетаФактуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка
		|ИЗ
		|	Документ.СчетФактура КАК СчетФактура
		|ГДЕ
		|	СчетФактура.ТипСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Выданный)
		|	И СчетФактура.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СчетФактура.Организация = &Организация
		|	И СчетФактура.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ГОД) И КОНЕЦПЕРИОДА(&Дата, ГОД)
		|	И СчетФактура.Ссылка <> &Ссылка
		|	И СчетФактура.НомерСчетаФактуры = &НомерСчетаФактуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачислениеЗадолженности.Ссылка
		|ИЗ
		|	Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|		ПО НачислениеЗадолженности.Договор = Договоры.Ссылка
		|			И (Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Аренды))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровАренды.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И ВидДоговораАренды = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровАренды.Передачи)) КАК УсловияДоговоровАрендыСрезПоследних
		|		ПО (Договоры.Ссылка = УсловияДоговоровАрендыСрезПоследних.Договор)
		|ГДЕ
		|	НачислениеЗадолженности.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НачислениеЗадолженности.Организация = &Организация
		|	И НачислениеЗадолженности.ДатаСчетаФактуры МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ГОД) И КОНЕЦПЕРИОДА(&Дата, ГОД)
		|	И НачислениеЗадолженности.Ссылка <> &Ссылка
		|	И НачислениеЗадолженности.НомерСчетаФактуры = &НомерСчетаФактуры";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НомерСчетаФактуры", НомерСчетаФактуры);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номер счета фактуры " + НомерСчетаФактуры 
			+ " кроме документа " + Ссылка + " также присвоен документу " + ВыборкаДанных.Ссылка, ВыборкаДанных.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСрокОплатыНДС(Период, ВидЗадолженности, ТипЗадолженности) Экспорт
	
	ДатаОплатыНДС = Неопределено;
	
	Если ВидЗадолженности = Справочники.ВидыЗадолженности.НДСТекущегоПериода Тогда
		
		//для кредиторки - 25 числа последнего месяца следующего квартала. Скорректировать на рабочие дни
		//для дебиторки - до конца следующего квартала
		Если ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда
			
			//с 4 квартала 2022 года срок оплаты НДС - 28 число. Ранее - 25.
			ЧислоСрокаОплаты = ?(Период < Дата(2022,12,30), 25, 28);
			
			СледующийКвартал = КонецКвартала(ДобавитьМесяц(Период, 3));
			ДатаОплатыНДС = Дата(Год(СледующийКвартал), Месяц(СледующийКвартал), ЧислоСрокаОплаты);
			ДатаОплатыНДС = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ДатаОплатыНДС, 1);
			
		Иначе
			
			Если Период < Дата(2024, 4, 1) Тогда
				ДатаОплатыНДС = КонецКвартала(ДобавитьМесяц(Период, 3));
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.НДСПоПриобретеннымЦенностям Тогда
		
		//до конца текущего квартала, т.к. в конце квартала зачитываем
		ДатаОплатыНДС = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, КонецКвартала(Период), -1);
		
	Иначе
		ВызватьИсключение("Получение срока оплаты НДС для вида задолженности " + ВидЗадолженности + " не имеет смысла!");
	КонецЕсли;
	
	
	Возврат ДатаОплатыНДС;
	
КонецФункции

Функция ПолучитьСтавкуНДСДляДокумента(Ссылка, Отказ) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НачислениеЗадолженностиОснования.СтавкаНДС КАК СтавкаНДС
			|ИЗ
			|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
			|ГДЕ
			|	НачислениеЗадолженностиОснования.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	НачислениеЗадолженностиОснования.СтавкаНДС";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество()=1 Тогда
			
			ВыборкаДетальныеЗаписи.Следующий(); 
			
			Возврат ВыборкаДетальныеЗаписи.СтавкаНДС;
			
		КонецЕсли;
		
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить ставку НДС для "+Ссылка,,,,Отказ);
	
	Возврат Неопределено;
	
КонецФункции

Процедура СформироватьПроводкиЗачетаНДСПоАвансам(ДокументСсылка, Движения, Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЗадолженностиПоДенежнымСредствам.Сумма) КАК СуммаНДСПоАвансу,
		|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствам.Основание КАК Основание
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Регистратор = &Регистратор
		|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоАвансам)
		|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствам.Основание";
	
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.СуммаНДСПоАвансу, "НДС по авансу");
		
		Если ВыборкаДетальныеЗаписи.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская Тогда
			
			Проводка.СчетДт = ПланыСчетов.Основной.НДС;
			Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
			Проводка.СчетКт = ПланыСчетов.Основной.НДСПоАвансамПолученным;
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			Проводка.СубконтоКт.СчетаФактуры = ВыборкаДетальныеЗаписи.Основание;
			
		Иначе
			
			Проводка.СчетДт = ПланыСчетов.Основной.НДСПоАвансамВыданным;
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			Проводка.СубконтоДт.СчетаФактуры = ВыборкаДетальныеЗаписи.Основание;
			
			Проводка.СчетКт = ПланыСчетов.Основной.НДС;
			Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает сумму НДС
//
// Параметры:
//	Сумма - сумма, от которой надо посчитать НДС
//  СтавкаНДС - ставка НДС в процентах или ссылка на перечисление "Ставки НДС"
//
// Возвращаемое значение:
//  Число - сумма НДС
//
Функция ПосчитатьСуммуНДС(Сумма, Знач СтавкаНДС) Экспорт
	
	Если ТипЗнч(СтавкаНДС) = Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
		СтавкаНДС = РаботаСНалогамиКлиентСервер.ПолучитьСтавкуНДС(СтавкаНДС);
	КонецЕсли;
	
	Возврат Сумма * СтавкаНДС / (100 + СтавкаНДС);
	
КонецФункции
